Tekla Open API Reference for Tekla Structures 2025
BoltArray.SetBoltDistX Method
 Sets the X distance at the index defined by the argument.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool SetBoltDistX(
	int Index,
	double DistX
)
Public Function SetBoltDistX (
	Index As Integer,
	DistX As Double
) As Boolean
Parameters
Index
Type: System.Int32
The index to the distance list.
DistX
Type: System.Double
The X distance to be used.
Return Value
Type: Boolean
True if the distance was modified. False if the index is out of range.
See Also
Reference
BoltArray Class
Tekla.Structures.Model Namespace